SitemplateCore::Engine.load_seed

p = Page.new title: 'О нас', slug: 'about'
p.short = '<p>
       Мы являемся сторонниками освоения иностранных языков не переходя от изучения  правил и зубрежки слов к использованию, а наоборот: от практики  использования языка, пользуясь аналогиями с вашим родным языком к  пониманию правил и различий между языками. Этот сайт  предназначен для того, чтобы сделать этот процесс максимально  эффективным и удобным.
</p>'
p.content = '<p>
               Мы являемся сторонниками освоения иностранных языков не переходя от изучения правил и зубрежки слов к использованию, а наоборот: от практики использования языка, пользуясь аналогиями с вашим родным языком к пониманию правил и различий между языками. Этот сайт предназначен для того, чтобы сделать этот процесс максимально эффективным и удобным.
</p>
<p>
       Дело в том, что обычно не достаточно просто получать информацию о языке и выполнять узко-специализированные упражнения по пройденному разделу. Во избежание потери навыка использования языка, требуется постоянное повторение пройденного материала, в полном объеме, в различных вариациях и контекстах. В этом смысле практику языка можно сравнить с гимнастикой, позволяющей поддерживать необходимую физическую форму, только в применении к умственным способностям.
</p>
<p>
           Мы предлагаем набор курсов, которые используют различные подходы для достижения одной цели: доведение до автоматизма навыка выражения мыслей на иностранным языком. Все курсы обладают одной общей чертой: они основаны на практике построения фраз на иностранном языке с первого занятия и могут использоваться как для изучения языка с нуля, так и для улучшения навыка использования языка с целью увеличения скорости выражения на иностранном языке. Получив информацию о контексте, цели и грамматической структуре фразы, обучение производится через ее перевод на изучаемый язык в письменной форме. При этом правильность написания контролируется программно и оповещение об ошибках происходит немедленно. Как в течение одного урока, так и в следующих занятих происходит повторение пройденного материала. Некоторые курсы дополняют уже существующие аудио-курсы, позволяющие совершенствовать произношение и восприятие языка на слух. Кроме того, наши упражнения могут использоваться в качестве дополнительного практикума при занятиях в группе с преподавателем и поддержания навыков использования языка при отсутствии занятий.
</p>
<p>
        Необходимым условием успеха в изучении языка является регулярность занятий. Лучше уделять тренировке пол-часа каждый день, чем заниматься несколько часов два раза в неделю.
</p>'

p.save
